       IDENTIFICATION DIVISION.
       PROGRAM-ID. TEST.

       PROCEDURE DIVISION.
           DISPLAY "COBOL WORKS!".
           STOP RUN.
           